In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime

In [2]:
prices = pd.read_excel('110619-_POC3_Prices_Annualy__Key_.xlsx')#, encoding='utf-8-sig')
invCount = pd.read_excel('22052019-_POC3_Inventory_Count.xlsx')

consumption = pd.read_excel('POC3_Consumption_Rates.xlsx',usecols=["Name","Name_AR","Average"])#, encoding='utf-8-sig'))
# operations = pd.read_excel('210919- POC2 (Com Name).xlsx')#, encodingServiceDate='uService Namet-sig')

** 1- Handling the Annual Prices table first **

In [3]:
prices.rename(columns={"No column name":"year"},inplace=True)
prices.head()

   year                      Name  Avg Unit Price
0  2016  حقنة أيليا (1/3 أمبول )      1211.113333
1  2016             كانيولا لليزك       26.720000
2  2016                ميكروباك\t        6.026667
3  2016       قسطرة نيلتون مقاس12        0.566667
4  2016                    فيسكوت       83.228718

* Making sure that there is no missing SKUs in 2018

In [4]:
print(len(prices[prices.year==2016]))
print(len(prices[prices.year==2017]))
print(len(prices[prices.year==2018]))

1028
1117
1302

* Filtering prices to the prices of 2018 only

In [5]:
filt_prices=prices[prices.year==2018].reset_index(drop=True)

In [6]:
filt_prices.isna().sum()

year              0
Name              0
Avg Unit Price    0
dtype: int64

In [7]:
filt_prices.duplicated().sum()

0

In [8]:
filt_prices.head()

   year                      Name  Avg Unit Price
0  2018  حقنة أيليا (1/3 أمبول )      1301.666667
1  2018           زجاجة Revonto\t     1164.000000
2  2018          صوديوم بيكربونات       28.333333
3  2018             كانيولا لليزك       46.666667
4  2018                ميكروباك\t        8.486667

** 2- Handling the Consumption Rate table  **

In [9]:
consumption.Average=consumption.Average.apply(lambda x:round(x))

In [10]:
consumption.head()

                               Name             Name_AR  Average
0  أمبولات ببترليف (بديل الزانتاك )    D.C.R. - العينين        1
1                  أمبولات فولتارين    D.C.R. - العينين        1
2                     بخاخة أوترفين    D.C.R. - العينين        1
3                         جلوكوز 5%  D.C.R. - عين واحدة        1
4  أمبولات ببترليف (بديل الزانتاك )  D.C.R. - عين واحدة        1

** 3- Handling the Inventory Count table **

In [11]:
invCount = invCount[['EntryDate','(No column name)','(No column name).1','LastCount']]
invCount.columns = ['EntryDate','Class','type','Count']

In [12]:
invCount.head()

   EntryDate                      Class            type  Count
0 2018-01-06               مشارط جراحية     كيراتوم 1.2   4956
1 2018-01-06               مشارط جراحية      كيراتوم2.2   5976
2 2018-01-06               مشارط جراحية      كيراتوم2.4    510
3 2018-01-06                     سرنجات       سرنجة 5سم   7800
4 2018-01-06  جوانتيات معقمه وغير معقمه  جوانتى أنسيل 7   5780